Repository: bhuisgen/pfwd
Catalog: po/*.po
Languages: fr

source: error in configuration file
fr: erreur dans le fichier de configuration

source: no group 'main'
fr: aucun groupe 'main'

source: the first group is not 'main'
fr: le premier groupe n'est pas 'main'

source: error in configuration file, aborting reload
fr: erreur dans le fichier de configuration, rechargement ignoré

source: no forwarder group
fr: aucun groupe de redirection trouvé

source: invalid listen address
fr: adresse d'écoute invalide

source: invalid IPv6 listen address
fr: adresse IPv6 d'écoute non valide

source: invalid IPv4 listen address
fr: adresse IPv4 d'écoute non valide

source: invalid unix listen path
fr: adresse unix d'écoute non valide

source: invalid listen address format
fr: format d'adresse d'écoute invalide

source: invalid listen port
fr: port d'écoute non valide

source: invalid listen socket backlog
fr: taille de la file d'attente de connexions réseau non valide

source: listen socket owner cannot be changed
fr: le propriétaire de la socket d'écoute ne peut être modifié

source: invalid listen socket owner
fr: propriétaire de la socket d'écoute non valide

source: listen socket group cannot be changed
fr: le groupe de la socket d'écoute ne peut être modifié

source: invalid listen socket group
fr: groupe de la socket d'écoute non valide

source: listen socket group is not present
fr: le groupe de la socket d'écoute n'est pas spécifié

source: listen socket owner is not present
fr: le propriétaire de la socket d'écoute n'est pas spécifié

source: invalid listen socket mode
fr: mode de la socket d'écoute non valide

source: invalid forward address
fr: adresse de redirection non valide

source: invalid IPv6 forward address
fr: adresse IPv6 de redirection non valide

source: invalid IPv4 forward address
fr: adresse IPv4 de redirection non valide

source: invalid unix forward path
fr: adresse unix de redirection non valide

source: invalid forward address format
fr: format d'adresse de redirection non valide

source: invalid forward port
fr: port de redirection non valide

source: setting socket buffer size to minimal value
fr: sélection de la taille minimale du buffer réseau

source: running main loop
fr: exécution de la boucle principale

source: failed to retrieve main loop
fr: échec de récupération de la boucle principale

source: exiting main loop
fr: arrêt de la boucle principale

source: failed to create local IPv6 socket
fr: échec de création de la socket IPv6 locale

source: failed to bind local IPv6 socket
fr: échec de liaison de la socket IPv6 locale

source: failed to listen on local IPv6 socket
fr: échec d'écoute de la socket IPv6 locale

source: failed to create local IPv4 socket
fr: échec de création de la socket IPv4 locale

source: failed to bind local IPv4 socket
fr: échec de liaison de la socket IPv4 locale

source: failed to listen on local IPv4 socket
fr: échec d'écoute de la socket IPv4 locale

source: failed to create local unix socket
fr: échec de création de la socket unix locale

source: failed to bind local unix socket
fr: échec de liaison de la socket unix locale

source: failed to listen on local unix socket
fr: échec d'écoute de la socket unix locale

source: failed to retrieve the user name, trying the user id
fr: échec de récupération du nom de l'utilisateur, essai sur l'identifiant utilisateur

source: invalid value
fr: valeur non valide

source: failed to retrieve the local unix socket owner
fr: échec de récupération du propriétaire de la socket unix locale

source: failed to retrieve the group name, trying the group id
fr: échec de récupération du nom du groupe, essai sur l'identifiant de groupe

source: failed to retrieve the local unix socket group
fr: échec de récupération du groupe de la socket unix locale

source: failed to set the local unix socket owner/group
fr: échec d'affectation du propriétaire/groupe de la socket unix locale

source: failed to set the local unix socket rights
fr: échec d'affectation des droits de la socket unix locale

source: accept watcher created
fr: observateur d'acceptation créé

source: accept watcher started
fr: observateur d'acceptation démarré

source: socket is listening
fr: socket en écoute

source: accept watcher stopped
fr: observateur d'acceptation arrêté

source: accept watcher cleaned
fr: observateur d'acceptation nettoyé

source: server read watcher stopped
fr: observateurs de lecture serveur arrêté

source: server read watchers cleaned
fr: observateur de lecture serveur nettoyé

source: client read watcher stopped
fr: observateur de lecture clients arrêté

source: client read watchers cleaned
fr: observateurs de lecture client nettoyés

source: unix socket file deleted
fr: fichier de socket unix supprimé

source: socket closed
fr: socket fermée

source: new accept event
fr: nouvel évènement d'acceptation

source: no data found, ignoring accept event
fr: pas de données trouvées, évènement d'acceptation ignoré

source: failed to accept new IPv6 client
fr: échec d'acceptation du nouveau client IPv6

source: failed to resolv IPv6 client address
fr: échec de résolution de l'adresse IPv6 du client

source: IPv6 client address denied
fr: adresse IPv6 client interdite

source: IPv6 client address allowed
fr: adresse IPv6 client autorisée

source: failed to accept new IPv4 client
fr: échec d'acceptation du nouveau client IPv4

source: failed to resolv IPv4 client address
fr: échec de résolution de l'adresse IPv4 du client

source: IPv4 client address denied
fr: adresse IPv4 client interdite

source: IPv4 client address allowed
fr: adresse IPv4 client autorisée

source: failed to accept new unix client
fr: échec d'acceptation du nouveau client unix

source: failed to create remote IPv6 socket
fr: échec de création de la socket IPv6 distante

source: failed to bind remote IPv6 socket
fr: échec de liaison de la socket IPv6 distante

source: failed to connect remote IPv6 socket
fr: échec de connexion de la socket IPv6 distante

source: failed to create remote IPv4 socket
fr: échec de création de la socket IPv6 distante

source: failed to bind remote IPv4 socket
fr: échec de liaison de la socket IPv4 distante

source: failed to connect remote IPv4 socket
fr: échec de connexion de la socket IPv4 distante

source: failed to create remote unix socket
fr: échec de création de la socket unix distante

source: failed to bind remote unix socket
fr: échec de liaison de la socket unix distante

source: failed to connect remote unix socket
fr: échec de connexion de la socket unix distante

source: client read watcher created
fr: observateur de lecture client créé

source: client read watcher started
fr: observateur de lecture client démarré

source: server read watcher created
fr: observateur de lecture serveur créé

source: server read watcher started
fr: observateur de lecture serveur démarré

source: new client connection
fr: nouvelle connection client

source: new read event
fr: nouvel évènement de lecture

source: no data found, ignoring read event
fr: pas de données trouvées, évènement de lecture ignoré

source: read event data
fr: données de l'évènement de lecture

source: bytes readed
fr: octets lus

source: read error
fr: erreur de lecture

source: read watcher stopped
fr: observateur de lecture stoppé

source: client connection closed
fr: connection client fermée

source: server connection closed
fr: connection serveur fermée

source: bytes written
fr: octets écrits

source: write error
fr: erreur d'écriture

source: IP address matches deny rule
fr: l'adresse IP correspond à une règle d'autorisation

source: IP address matches allow rule
fr: l'adresse IP correspond à une règle d'interdiction

source: IP address matches default deny rule
fr: l'adresse IP correspond à la régle d'interdiction par défaut

source: IP address matches default allow rule
fr: l'adresse IP correspond à la règle d'autorisation par défaut

source: Read configuration from file
fr: lire la configuration depuis le fichier

source: FILE
fr: FICHIER

source: Set verbose output
fr: Fixe le niveau de verbosité

source: Show version information
fr: Affiche les informations de version

source: Local address
fr: Adresse locale

source: ADDRESS
fr: ADRESSE

source: Local port
fr: Port local

source: Local socket backlog
fr: Taille de la file d'attente de connexions de la socket locale

source: LENGTH
fr: TAILLE

source: User of the local unix socket
fr: Echec de création de la socket unix locale

source: NAME
fr: NOM

source: Group of the local unix socket
fr: Groupe de la socket unix locale

source: Mode of the local unix socket
fr: Echec de création de la socket unix locale

source: Forward address
fr: Adresse de redirection

source: Forward port
fr: Port de redirection

source: Socket buffer size
fr: Taille de buffer socket

source: SIZE
fr: TAILLE

source: [FORWARDER]
fr: [REDIRECTION]

source: forwarder
fr: redirection

source: Forwarder Options
fr: Options Redirection

source: Show all forwarder options
fr: Afficher toutes les options d'une redirection

source: The configuration file doesn't exist or cannot be read.
fr: Le fichier de configuration n'existe pas ou ne peut être lu.

source: SIGPIPE received, continuing execution
fr: SIGPIPE reçu, poursuite de l'exécution

source: SIGHUP received, reloading configuration
fr: SIGHUP reçu, rechargement de la configuration

source: SIGINT received, exiting
fr: SIGINT reçu, abandon de l'exécution

source: SIGTERM received, exiting
fr: SIGTERM reçu, abandon de l'exécution

source: cleanup
fr: nettoyage

source: daemon stopped
fr: démon stoppé

source: GLib version 2.6.0 or above is needed
fr: La librairie GLib version 2.6.0 ou supérieure est requise

source: Failed to create events logger.
fr: Echec de création du journaliseur d'évènements.

source: failed to daemonize, error code
fr: échec de démonisation, code d'erreur

source: daemon started
fr: démon démarré
